InformationRegisters/НастройкиОценкиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОценкиПерсонала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьОценкуПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/МероприятияОценкиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МероприятияОценкиПерсонала</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияРеспондентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗаполненияРеспондентовВОценке360</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииРеспонденты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииСотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьВопросыКомпетенций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КомпетенцииПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыХарактеристик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПерсонала</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОпроса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеспондентыЕдиныйНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРеспондента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольРеспондента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОценкаПерсоналаСобытия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура-обработчик события "ПриЗаписи" регистра сведений РегистрСведений.ОтветыНаВопросыАнкет.
//
// Параметры:
//	НаборЗаписейРегистра	- РегистрСведенийНаборЗаписей - источник события.
//	Отказ					- Булево - флаг отказа от выполнения обработчика.
//	Отказ					- Булево - флаг отказа от выполнения обработчика.
//	Замещение				- Булево - флаг замещения записей при записи.
Процедура ПересчитатьОценкиПоМероприятию(НаборЗаписейРегистра, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписейРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Удаление = НаборЗаписейРегистра.Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение);
	Если Удаление Тогда
		Возврат;
	КонецЕсли;
	
	Анкеты = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписейРегистра, Замещение, "Регистратор");
	Если Анкеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Анкеты[0], "Опрос") Тогда
		Возврат;
	КонецЕсли;
	
	Опросы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Анкеты, "Опрос");
	Для Каждого Анкета Из Анкеты Цикл
		Опрос = Опросы[Анкета];
		Если Не ЗначениеЗаполнено(Опрос) Тогда
			Продолжить;
		КонецЕсли;
		
		Мероприятия = СписокМероприятийПоНазначению(Опрос);
		Для Каждого Мероприятие Из Мероприятия Цикл
			ОценкаПерсонала.РассчитатьОценкиПоОтветам(Мероприятие, Анкета, Удаление);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик подписки на событие УстановитьИспользованиеОценкиПерсонала
//
// Параметры:
//	Источник - КонстантаМенеджерЗначения.ИспользоватьАнкетирование, КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений.
//	Отказ - Булево - отказ от стандартной обработки
//
Процедура УстановитьИспользованиеОценкиПерсоналаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.Значение Тогда
		НастройкаОценки = РегистрыСведений.НастройкиОценкиПерсонала.СоздатьМенеджерЗаписи();
		НастройкаОценки.Прочитать();
		Если НастройкаОценки.ИспользоватьОценкуПерсонала Тогда
			// Значит надо выключить оценку, так как ее использование без "Анкетирования" невозможно.
			НастройкаОценки.ИспользоватьОценкуПерсонала = Ложь;
			НастройкаОценки.Записать(Истина);
			
			Если ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьАнкетирование") Тогда
				НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Анкетирования'");
			ИначеЕсли ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений") Тогда
				НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Шаблонов сообщений'");
			Иначе
				НаименованиеИсточникаРодительныйПадеж = "";
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Использование Оценки персонала невозможно без использования %1. Оценка персонала так же было выключено.'"),
					НаименованиеИсточникаРодительныйПадеж);

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СписокМероприятийПоНазначению(НазначениеОпроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МероприятияОценкиПерсоналаУчастники.Ссылка КАК Мероприятие
		|ИЗ
		|	Справочник.МероприятияОценкиПерсонала.Участники КАК МероприятияОценкиПерсоналаУчастники
		|ГДЕ
		|	МероприятияОценкиПерсоналаУчастники.НазначениеОпроса = &НазначениеОпроса";
	Запрос.УстановитьПараметр("НазначениеОпроса", НазначениеОпроса);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Мероприятие");
	
КонецФункции

#КонецОбласти
